БИТУправление_медицинским_центром_демо/src/Catalogs/СтраховыеПолисы/СтраховыеПолисы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтраховыеПолисы</name>
  <owners>Catalog.Клиенты</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолиса</name>
    <type>
      <types>CatalogRef.ВидыПолисов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтраховаяКомпания</name>
    <type>
      <types>CatalogRef.умцСтраховыеКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеДействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассификаторВидовПолисовРЭМД</name>
    <type>
      <types>CatalogRef.КлассификаторыМинЗдрава</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/СтраховыеПолисы/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Наименование = СокрЛП(ЭтотОбъект.ВидПолиса.Наименование);
	Если ЗначениеЗаполнено(Номер) Или ЗначениеЗаполнено(Серия) Тогда
		НомерСерия = СокрЛП(СокрЛП(Номер)+ ?(ЗначениеЗаполнено(Серия)," серия " + СокрЛП(Серия),""));
		Если Не ПустаяСтрока(НомерСерия) Тогда
			Наименование = Наименование + " " + НомерСерия;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
